#+PROPERTY: header-args:sql :engine "postgresql" :dbuser postgres :dbpassword "123456" :database sample_app_development :dbhost localhost
#+OPTIONS: ^:nil
#+TITLE: How I sped up demo data generation by 97%

*** Check for schema existence
Knowing about the existence of ~pg_namespace~ gives us the ability to understand the first section of code:
#+begin_src SQL
-- Check that source_schema exists
    SELECT oid INTO src_oid
      FROM pg_namespace
     WHERE nspname = quote_ident(source_schema);
    IF NOT FOUND
      THEN 
      RAISE NOTICE 'source schema % does not exist!', source_schema;
      RETURN;
        END IF;

    -- Check that dest_schema does not yet exist
    PERFORM nspname 
      FROM pg_namespace
     WHERE nspname = quote_ident(dest_schema);
    IF FOUND
      THEN 
      RAISE NOTICE 'dest schema % already exists!', dest_schema;
      RETURN ;
    END IF;

    EXECUTE 'CREATE SCHEMA ' || quote_ident(dest_schema) ;
#+end_src

Unfortunately, we can't really run that as pure SQL in its current form. So instead, we need to make it a function so we can normalize the results:
#+NAME: Check that source_schema exists
#+begin_src SQL
  CREATE OR REPLACE FUNCTION check_existence(
    source_schema text)
    RETURNS bool AS $BODY$
  BEGIN
  
   PERFORM oid
      FROM pg_namespace
     WHERE nspname = quote_ident(source_schema);
    IF NOT FOUND
    THEN
      RAISE NOTICE 'source schema % does not exist!', source_schema;
      RETURN false;
    ELSE
      RETURN true;
    END IF;
  END;
  $BODY$

  LANGUAGE plpgsql VOLATILE
  COST 100;
#+end_src

#+RESULTS: Check that source_schema exists
| CREATE FUNCTION |
|-----------------|

And then, we can test it to see if a schema does exist:
#+begin_src SQL
  SELECT check_existence('public');
#+end_src

#+RESULTS:
| check_existence |
|-----------------|
| t               |


We can also check for the non-existence of a schema:
#+NAME: Check that the dest schema doesn't exist
#+begin_src SQL
  SELECT check_existence('backup');
#+end_src

#+RESULTS: Check that the dest schema doesn't exist
|---|

*** Creating a schema
Great, now we know that the ~backup~ schema doesn't exist. Let's make one. Luckily, creating a schema is pretty easy:
#+begin_src SQL
 CREATE SCHEMA backup;
#+end_src

#+RESULTS:
| CREATE SCHEMA |
|---------------|

Now we can use our function to verify:
#+begin_src SQL
  SELECT check_existence('backup');
#+end_src

#+RESULTS:
| check_existence |
|-----------------|
| t               |

**** 2. Create Sequence
Creating a list of sequences looks like this:
#+begin_src SQL
  FOR object IN
  SELECT
    sequence_name::text
  FROM
    information_schema.sequences
  WHERE
    sequence_schema = quote_ident(source_schema)
    LOOP
      EXECUTE 'CREATE SEQUENCE ' || quote_ident(dest_schema) || '.' || quote_ident(object);

  END LOOP;
#+end_src

Generally, in a schema, there are a lot of sequences. One for each table with an index. So, let's zoom in on one sequence and follow it through the process.

From the code above, where you see ~object~, we will replace it with ~microposts_id_seq'~, one of the values from the above select statement.
#+begin_src sql
  CREATE SEQUENCE backup.microposts_id_seq;
#+end_src

#+RESULTS:
| CREATE SEQUENCE |
|-----------------|

And let's take a look at what we made
#+begin_src sql
  SELECT * FROM backup.microposts_id_seq;
#+end_src

#+RESULTS:
| last_value | log_cnt | is_called |
|------------+---------+-----------|
|          1 |       0 | f         |

We made a table that stores values for last_value, log_cnt[fn:1], and is_called[fn:2].

**** 3. Copy Sequence Values
Now we're going to fake it a little bit to see what the following statement is doing more easily.

We can translate:
#+begin_src sql
  seq_query: = format('SELECT max_value, start_value, increment_by, min_value, cache_size, cycle FROM pg_sequences
    WHERE sequencename = %L AND schemaname = %L ;', object, source_schema);

  EXECUTE seq_query INTO sq_max_value,
  sq_start_value,
  sq_increment_by,
  sq_min_value,
  sq_cache_value,
  sq_is_cycled;
#+end_src

To:
#+begin_src sql
  SELECT
    max_value AS sq_max_value,
    start_value AS sq_start_value,
    increment_by AS sq_increment_by,
    min_value AS sq_min_value,
    cache_size AS sq_cache_value,
    CYCLE AS sq_is_cycled
  FROM
    pg_sequences
  WHERE
    sequencename = 'microposts_id_seq'
    AND schemaname = 'public';
#+end_src

Which gets us a nice little table:
#+RESULTS:
|        sq_max_value | sq_start_value | sq_increment_by | sq_min_value | sq_cache_value | sq_is_cycled |
|---------------------+----------------+-----------------+--------------+----------------+--------------|
| 9223372036854775807 |              1 |               1 |            1 |              1 | f            |

Now because of how SQL works, we have to convert data. So we translate the value ~sq_is_cycled~ from a boolean to a string.
#+begin_src SQL
  IF sq_is_cycled THEN
    sq_cycled := 'CYCLE';

  ELSE
    sq_cycled := 'NO CYCLE';

  END IF;
#+end_src

If we go to the table above, we can see that ~sq_is_cycled~ is false, which means ~sq_cycled~ is set to ~'NO CYCLE'~.

#+begin_comment
 Note: because the code above requires variables, we can't run this outside of a function, so we just have to evaluate it inside our heads.
#+end_comment

So now we want to copy over the data from ~public.microposts_id_seq~ to ~backup.microposts_id_seq~
#+begin_src sql
  ALTER SEQUENCE backup.microposts_id_seq
    INCREMENT BY 1
    MINVALUE 1
    MAXVALUE 9223372036854775807 START WITH 1 RESTART 1
    CACHE 1 NO CYCLE;
#+end_src

Now, we can run the same select query to get data about a sequence to verify that we have successfully cloned ~microposts_id_seq~ into ~backup~
#+begin_src sql
  SELECT
    max_value AS sq_max_value,
    start_value AS sq_start_value,
    increment_by AS sq_increment_by,
    min_value AS sq_min_value,
    cache_size AS sq_cache_value,
    CYCLE AS sq_is_cycled
  FROM
    pg_sequences
  WHERE
    sequencename = 'microposts_id_seq'
    AND schemaname = 'backup';

#+end_src

#+RESULTS:
|        sq_max_value | sq_start_value | sq_increment_by | sq_min_value | sq_cache_value | sq_is_cycled |
|---------------------+----------------+-----------------+--------------+----------------+--------------|
| 9223372036854775807 |              1 |               1 |            1 |              1 | f            |

**** 4. Update sequence to match current values
Then because we're cloning both meta information and records themselves, we want to make sure our sequence values align with the ~public~'s sequence values.

#+begin_src sql
  seq_query := format('SELECT last_value, log_cnt, is_called FROM %s.%s;', source_schema, object);

  EXECUTE seq_query INTO sq_last_value,
  sq_log_cnt,
  sq_is_called;
#+end_src

So, now we need to get the current state of the sequence for microposts_id_seq
#+begin_src sql
  SELECT
    last_value AS sq_last_value,
    log_cnt AS sq_log_cnt,
    is_called AS sq_is_called
  FROM
    public.microposts_id_seq;
#+end_src

#+RESULTS:
| sq_last_value | sq_log_cnt | sq_is_called |
|---------------+------------+--------------|
|           300 |         30 | t            |

and update the ~backup~ schema
#+begin_src sql
  EXECUTE 'SELECT setval( ''' || buffer || ''', ' || sq_last_value || ', ' || sq_is_called || ');'
#+end_src

Which we can trivially translate to:
#+begin_src SQL
  SELECT
    setval('backup.microposts_id_seq', 300, TRUE);
#+end_src

#+RESULTS:
| setval |
|--------|
|    300 |

***** Let's quickly verify our work
If we call nextval on ~public.microposts_id_seq~ and ~backup.microposts_id_seq~ they should produce the same results.

#+begin_src sql
  SELECT
    nextval('public.microposts_id_seq');
#+end_src

#+RESULTS:
| nextval |
|---------|
|     301 |

#+begin_src sql
  SELECT
    nextval('backup.microposts_id_seq');
#+end_src

#+RESULTS:
| nextval |
|---------|
|     301 |

**** 1. Get all tables
We want to iterate over all the tables in a schema. But how do we get that information? Luckily, Postgres has meta-programming facilities based around schema's called [[https://www.postgresql.org/docs/current/information-schema.html][information_schema]] which has a [[https://www.postgresql.org/docs/13/sql-createview.html][view]] specifically for [[https://www.postgresql.org/docs/current/infoschema-tables.html][tables]].

In short if we run a command like below, we can get a list of all table names that are in the public schema.
#+begin_src sql
  -- FOR OBJECT In
  SELECT
    TABLE_NAME::text
  FROM
    information_schema.tables
  WHERE
    table_schema = 'public'
    AND table_type = 'BASE TABLE'
#+end_src

#+RESULTS:
| table_name                     |
|--------------------------------|
| schema_migrations              |
| ar_internal_metadata           |
| active_storage_blobs           |
| users                          |
| microposts                     |
| active_storage_attachments     |
| active_storage_variant_records |
| relationships                  |

**** 2. Copying table structure

Like in sequences, we will step through copying one table as an example of how it works across the entire system. Let's operate on the ~microposts~ table.

It's surprisingly simple to copy table structures across schemas. When doing a CREATE table operation, we can interpret the following as "copy this table with X columns, indexes, and constraints." All we need are two new pieces of syntax: [[https://www.postgresql.org/docs/current/sql-createtable.html][LIKE and INCLUDING]].

#+BEGIN_QUOTE
The LIKE clause specifies a table from which the new table automatically copies all column names, their data types, and their not-null constraints.
- Postgres Documentation
#+END_QUOTE

#+begin_src sql
  CREATE TABLE backup.microposts (
    LIKE public.microposts INCLUDING ALL
  );
#+end_src

#+RESULTS:
| CREATE TABLE |
|--------------|

We can verify that this works by seeing that the table exists but is void of any data:
 
#+begin_src SQL
  SELECT
    id,
    content
  FROM
    backup.microposts
#+end_src

#+RESULTS:
| id | content |
|----+---------|

**** 3. Copy Data
Copying data is one of the least complicated interactions we have. It's just a combination of INSERT and SELECT operations.

#+NAME: Copying data using select and insert
#+begin_src sql
  INSERT INTO backup.microposts
  SELECT * FROM
    public.microposts;
#+end_src

#+RESULTS: Copying data using select and insert
| INSERT 0 300 |
|--------------|

We can admire our handiwork by using a SELECT and a [[https://www.postgresql.org/docs/14/queries-table-expressions.html][RIGHT JOIN]] statement to compare the two tables.

😲

Shocking, I know.
#+begin_src sql
  SELECT
    public.microposts.content AS public_content,
    public.microposts.id AS public_id,
    backup.microposts.content AS backup_content,
    backup.microposts.id AS backup_id
  FROM
    backup.microposts
    RIGHT JOIN public.microposts ON backup.microposts.id = public.microposts.id
  LIMIT 10;
#+end_src

#+RESULTS:
| public_content                       | public_id | backup_content                       | backup_id |
|--------------------------------------+-----------+--------------------------------------+-----------|
| Quisquam non ut aliquid repudiandae. |         1 | Quisquam non ut aliquid repudiandae. |         1 |
| Quisquam non ut aliquid repudiandae. |         2 | Quisquam non ut aliquid repudiandae. |         2 |
| Quisquam non ut aliquid repudiandae. |         3 | Quisquam non ut aliquid repudiandae. |         3 |
| Quisquam non ut aliquid repudiandae. |         4 | Quisquam non ut aliquid repudiandae. |         4 |
| Quisquam non ut aliquid repudiandae. |         5 | Quisquam non ut aliquid repudiandae. |         5 |
| Quisquam non ut aliquid repudiandae. |         6 | Quisquam non ut aliquid repudiandae. |         6 |
| Vitae quisquam facilis qui vel.      |         7 | Vitae quisquam facilis qui vel.      |         7 |
| Vitae quisquam facilis qui vel.      |         8 | Vitae quisquam facilis qui vel.      |         8 |
| Vitae quisquam facilis qui vel.      |         9 | Vitae quisquam facilis qui vel.      |         9 |
| Vitae quisquam facilis qui vel.      |        10 | Vitae quisquam facilis qui vel.      |        10 |

**** 4. Update Default/Sequence values for columns
When we created the ~backup.microposts~ table based off of the ~public.microposts~ table it copied everything, metadata included, word for word. However, this introduces a problem for us when we need to use our sequences from earlier. It copies and references _all of_ the old table's metadata, including the sequences table reference. So we need to search through the table's metadata and look for columns with a default value that uses sequences and replaces the inner text from referencing ~public~ to reference ~backup~.

We can generate a query that performs this for us
#+begin_src sql
  SELECT
    column_name::text,
    REPLACE(column_default::text, 'public', 'backup'),
    column_default::text
  FROM
    information_schema.COLUMNS
  WHERE
    table_schema = 'backup'
    AND TABLE_NAME = 'microposts'
    AND column_default LIKE 'nextval(%public%::regclass)'
#+end_src

#+RESULTS:
| column_name | replace | column_default |
|-------------+---------+----------------|

We can then use this information to update our apps table to reference the new sequences we generated.
#+begin_src sql
  ALTER TABLE backup.microposts
    ALTER COLUMN id SET DEFAULT nextval('backup.microposts_id_seq'::regclass);
#+end_src

And if you wonder what happens when we call nextval('backup.microposts_id_seq'::regclass), you can play with it below. In my example, it generates a monotonically increasing number, perfect for an object id.
#+begin_src sql
  SELECT
    nextval('backup.microposts_id_seq'::regclass);
#+end_src

#+RESULTS:
| nextval |
|---------|
|     301 |

**** 1. Get all constraints for source schema
Postgres has a catalogue called [[https://www.postgresql.org/docs/current/catalog-pg-constraint.html][pg_constraint]] that contains meta-information around all the constraints (foreign_key, primary_key, and exclusion) across the database. Unfortunately, that table is not sufficient to generate our query; we also need access to [[https://www.postgresql.org/docs/current/catalog-pg-class.html][pg_class]] which is a catalogue that keeps meta-information on anything that has a column in Postgres.

In ~pg_constraint~ it a has a column called contype, that describes the type on constraint that the row describes. Ex:
  + c = check constraint
  + f = foreign key constraint
  + p = primary key constraint
  + u = unique constraint
  + t = constraint trigger
  + x = exclusion constraint

So because we're looking for foreign key constraints, we can limit our query to ~ct.contype = 'f'~.

For ~pg_class~, it has a column called relkind that describes the kind of relations that row describes. Ex:
  + r = ordinary table
  + i = index
  + S = sequence
  + t = TOAST table
  + v = view
  + m = materialized view
  + c = composite type
  + f = foreign table
  + p = partitioned table
  + I = partitioned index

Because we've only really copied over tables, that's all we really care about for kinds of relation ~rn.relkind = 'r'~.

Putting this all together, we'd get a query like:
#+NAME: Constraints Query
#+begin_src SQL
  SELECT
    rn.relname,
    ct.conname,
    ct.oid
  FROM
    pg_constraint ct
    JOIN pg_class rn ON rn.oid = ct.conrelid
  WHERE
    connamespace = (
      SELECT
        oid
      FROM
        pg_namespace
      WHERE
        nspname = quote_ident('public'))
    AND rn.relkind = 'r'
    AND ct.contype = 'f';
#+end_src

#+RESULTS: Constraints Query
| relname                        | conname             |   oid |
|--------------------------------+---------------------+-------|
| microposts                     | fk_rails_558c81314b | 16428 |
| active_storage_attachments     | fk_rails_c3b3935057 | 16458 |
| active_storage_variant_records | fk_rails_993965df05 | 16476 |

**** 2. Generate a query to create constraints

Postgres has a function, [[https://www.postgresql.org/docs/13/functions-info.html#FUNCTIONS-INFO-CATALOG-TABLE][pg_get_constraintdef,]] that can generate a constraint definition based on an object id.

For example, I took a row from the constraints query above and got an OID of ~16428~.
#+NAME: Example row from constraints query
#+BEGIN_EXAMPLE
| relname                | conname             |   oid |
|------------------------+---------------------+-------|
| microposts             | fk_rails_d296c622dc | 16428 |
#+END_EXAMPLE

If we run a select statement on that function...
#+NAME: Sample constraints definition.
#+begin_src sql
SELECT pg_get_constraintdef(16428)
#+end_src

We get the following definition:
#+RESULTS: Sample constraints definition.
| pg_get_constraintdef                       |
|--------------------------------------------|
| FOREIGN KEY (user_id) REFERENCES users(id) |

We can then put this information with the Constraints Query to generate the query for us:
#+begin_src SQL
  SELECT
    'ALTER TABLE ' || quote_ident('backup') || '.' || quote_ident(rn.relname) || ' ADD CONSTRAINT ' || quote_ident(ct.conname) || ' ' || pg_get_constraintdef(ct.oid) || ';'
  FROM
    pg_constraint ct
    JOIN pg_class rn ON rn.oid = ct.conrelid
  WHERE
    connamespace = (
      SELECT
        oid
      FROM
        pg_namespace
      WHERE
        nspname = quote_ident('public'))
    AND rn.relkind = 'r'
    AND ct.contype = 'f'
  LIMIT 1;
#+end_src

#+RESULTS:
| ?column?                                                                                                     |
|--------------------------------------------------------------------------------------------------------------|
| ALTER TABLE backup.microposts ADD CONSTRAINT fk_rails_558c81314b FOREIGN KEY (user_id) REFERENCES users(id); |

*** Precursor
But before we can do that let's be absolutely sure that we don't have any views stored in our view catalog.
#+begin_src sql
       SELECT table_name::text
        FROM information_schema.views
       WHERE table_schema = quote_ident('public')
#+end_src

#+RESULTS:
| table_name |
|------------|

*** Creating our view

In our example, we'll create a view for all microposts created by a particular user.

#+NAME: Creating a new view
#+begin_src sql
  CREATE VIEW first_users_posts AS
    SELECT content, microposts.created_at as created_at, name
        FROM microposts, users
        WHERE users.id = (SELECT id FROM users LIMIT 1)
#+end_src

#+RESULTS: Creating a new view
| CREATE VIEW |
|-------------|

Now, lets validate that it works
#+NAME: Test our view
#+begin_src sql
SELECT * FROM first_users_posts LIMIT 10
#+end_src

#+RESULTS: Test our view
| content                              | created_at                 | name         |
|--------------------------------------+----------------------------+--------------|
| Quisquam non ut aliquid repudiandae. | 2021-12-15 05:17:48.07503  | Example User |
| Quisquam non ut aliquid repudiandae. | 2021-12-15 05:17:48.085981 | Example User |
| Quisquam non ut aliquid repudiandae. | 2021-12-15 05:17:48.093539 | Example User |
| Quisquam non ut aliquid repudiandae. | 2021-12-15 05:17:48.099877 | Example User |
| Quisquam non ut aliquid repudiandae. | 2021-12-15 05:17:48.106309 | Example User |
| Quisquam non ut aliquid repudiandae. | 2021-12-15 05:17:48.112993 | Example User |
| Vitae quisquam facilis qui vel.      | 2021-12-15 05:17:48.119943 | Example User |
| Vitae quisquam facilis qui vel.      | 2021-12-15 05:17:48.126818 | Example User |
| Vitae quisquam facilis qui vel.      | 2021-12-15 05:17:48.133882 | Example User |
| Vitae quisquam facilis qui vel.      | 2021-12-15 05:17:48.140942 | Example User |

*** Collecting the views
With all the dirty work done, we need to loop over all of the views in our catalogue. Luckily we've already seen the primary tool for that. Again, we'll be limiting our selection to one, so it's easier to follow along and go through this step by step.

#+NAME: Select one view
#+begin_src sql
       SELECT table_name::text
        FROM information_schema.views
       WHERE table_schema = quote_ident('public')
       LIMIT 1
#+end_src

#+RESULTS: Select one view
| table_name        |
|-------------------|
| first_users_posts |

*** Copying views
Great, we've got a view name. Now we can use that name to build up the name of the view for the destination scheme:

#+NAME: Naming the view
#+begin_src SQL
SELECT 'backup' || '.' || quote_ident('first_users_posts');
#+end_src

#+RESULTS: Naming the view
| ?column?                 |
|--------------------------|
| backup.first_users_posts |

Now that we've generated the name, we need to get the view definition:
#+NAME: View a definition
#+begin_src SQL
      SELECT view_definition
        FROM information_schema.views
       WHERE table_schema = quote_ident('public')
         AND table_name = quote_ident('first_users_posts');
#+end_src

#+RESULTS: View a definition
| view_definition                       |
|---------------------------------------|
| SELECT microposts.content,            |
| microposts.created_at,                |
| users.name                            |
| FROM microposts,                      |
| users                                 |
| WHERE (users.id = ( SELECT users_1.id |
| FROM users users_1                    |
| LIMIT 1));                            |

And then, finally, we can use these pieces of information to copy the view.
#+begin_src sql
  DO $$
  BEGIN
    EXECUTE 'CREATE OR REPLACE VIEW ' || 'backup' || '.' || quote_ident('first_users_posts') || ' AS ' || (
      SELECT
        view_definition
      FROM
        information_schema.views
      WHERE
        table_schema = quote_ident('public')
        AND table_name = quote_ident('first_users_posts')) || ';';
  END
  $$;
#+end_src
*** Generating a list of functions

We need at least one function to clone, so why not add the function that this article is about? You _could_ scroll all the way back to the page, copy and paste it in your psql or pgAdmin or whatever you're using to follow along... or you could do what the uncool kids are doing and evaluate the following expression in Emacs.
#+begin_src emacs-lisp
  (org-sbe clone_schema_func)
#+end_src

Now, we can search for all functions in our current schema
#+begin_src sql
      SELECT oid, proname, pronamespace
        FROM pg_proc
        WHERE proname = 'clone_schema'
#+end_src

#+RESULTS:
|   oid | proname      | pronamespace |
|-------+--------------+--------------|
| 16675 | clone_schema |         2200 |

We can do the same as our base query by getting the object id of our current schema...
#+begin_src SQL
SELECT oid
      FROM pg_namespace
     WHERE nspname = 'public'
#+end_src

#+RESULTS:
|  oid |
|------|
| 2200 |

and to put that together

#+begin_src sql
      SELECT oid, proname, pronamespace
        FROM pg_proc
        WHERE pronamespace = (SELECT oid
                              FROM pg_namespace
                              WHERE nspname = 'public')
#+end_src

#+RESULTS:
|   oid | proname         | pronamespace |
|-------+-----------------+--------------|
| 16497 | check_existence |         2200 |
| 16675 | clone_schema    |         2200 |

#+BEGIN_QUOTE
Wouldn't this be a lot easier when we're inside a function and have access to variables? Oh, and we have loops?
#+END_QUOTE

